Revit 2027 API
BuiltInFailures.StairRampFailures.StairsZeroDesiredRisers Property
 The number of desired risers for a staircase cannot be 0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsZeroDesiredRisers { get; }
Public Shared ReadOnly Property StairsZeroDesiredRisers As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsZeroDesiredRisers {
	FailureDefinitionId^ get ();
}
static member StairsZeroDesiredRisers : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace